# CenterNet meta-architecture from the "Objects as Points" [1] paper
# with the ResNet-v2-101 backbone. The ResNet backbone has a few differences
# as compared to the one mentioned in the paper, hence the performance is
# slightly worse. This config is TPU comptatible.
# [1]: https://arxiv.org/abs/1904.07850

model {
  center_net {
    num_classes: 2
    feature_extractor {
      type: "resnet_v2_50"
    }
    image_resizer {
      fixed_shape_resizer {
        height: 512
        width: 512
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      min_box_overlap_iou: 0.7
      max_box_predictions: 4
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
    }
  }
}

train_config: {

  batch_size: 12
  num_steps: 2000

  data_augmentation_options {
    random_horizontal_flip {
    }
  }

  data_augmentation_options {
    random_image_scale {
      min_scale_ratio: 0.8
    }
  }

  data_augmentation_options {
    random_jitter_boxes {
    }
  }

  data_augmentation_options {
    random_rgb_to_gray {
    }
  }

  data_augmentation_options {
    random_adjust_saturation {
    }
  }

  data_augmentation_options {
    random_absolute_pad_image {
    }
  }

  data_augmentation_options {
    random_crop_image {
    }
  }

  data_augmentation_options {
    random_adjust_contrast {
      max_delta: 1.3
    }
  }

  data_augmentation_options {
    random_black_patches {
      probability: 0.20,
      size_to_image_ratio: 0.05
    }
  }

  data_augmentation_options {
    random_adjust_brightness {
      max_delta: 0.25
    }
  }

  data_augmentation_options {
    random_adjust_hue {
      max_delta: 0.04
    }
  }

  optimizer {
    adam_optimizer: {
      epsilon: 1e-7  # Match tf.keras.optimizers.Adam's default.
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 1e-3
          total_steps: 2000
          warmup_learning_rate: 2.5e-4
          warmup_steps: 200
        }
      }
    }
    use_moving_average: false
  }
  max_number_of_boxes: 4
  unpad_groundtruth_tensors: false

  fine_tune_checkpoint_version: V2
  fine_tune_checkpoint_type: "detection"
}

train_input_reader: {
  label_map_path: "/home/alvaro/Desktop/hand-face-detector/utils/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/home/alvaro/Downloads/new_object_detection/train_records/*.tfrecord"
  }
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  batch_size: 12;
}

eval_input_reader: {
  label_map_path: "/home/alvaro/Desktop/hand-face-detector/utils/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/home/alvaro/Downloads/new_object_detection/validation_records/*.tfrecord"
  }
}
